Revit 2027 API
Group.GetShownAttachedDetailGroupTypeIds Method
 Returns the attached detail groups which have displayed instances for this group type in the input view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetShownAttachedDetailGroupTypeIds(
	View view
)
Public Function GetShownAttachedDetailGroupTypeIds (
	view As View
) As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetShownAttachedDetailGroupTypeIds(
	View^ view
)
member GetShownAttachedDetailGroupTypeIds :
        view : View -> ISet<ElementId>
Parameters
view View
 The view in which the attached detail groups are displayed.
Return Value
ISet<ElementId>
 The collection of attached detail group Ids that match this group's type.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The input group is not a model group and can therefore not have attached detail groups.
See Also
Reference
Group Class
Autodesk.Revit.DB Namespace